soap/miniupnp/miniupnpd-2.1-igd1/seeds/08_WANIPC-AddPortMapping_0

<?xml version="1.0" encoding="UTF-8"?><s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" ><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1"><NewRemoteHost /><NewExternalPort /><NewProtocol /><NewInternalPort /><NewInternalClient /><NewEnabled /><NewPortMappingDescription /><NewLeaseDuration /></u:AddPortMapping></s:Body></s:Envelope>
